{
  "patterns": [
    {
      "patternName": "agility_story",
      "description": "Generate user stories and acceptance criteria for agile development tasks following standard agile methodology formats.",
      "tags": [
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "ai",
      "description": "Interpret questions deeply and provide concise, insightful answers in brief markdown bullets focused on core concepts.",
      "tags": [
        "AI",
        "ANALYSIS"
      ]
    },
    {
      "patternName": "analyze_answers",
      "description": "Evaluate student responses against expert knowledge, providing detailed assessment and feedback adapted to specified academic levels.",
      "tags": [
        "ANALYSIS",
        "LEARNING"
      ]
    },
    {
      "patternName": "analyze_candidates",
      "description": "Compare political candidates' positions, highlighting key differences in policies, backgrounds, and potential implications of their platforms.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "analyze_cfp_submission",
      "description": "Evaluate conference presentation submissions for content quality, speaker qualifications, and potential audience engagement and educational value.",
      "tags": [
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "analyze_comments",
      "description": "Analyze user comments to determine sentiment patterns, extract key praise and criticism points, and summarize overall reception.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION"
      ]
    },
    {
      "patternName": "analyze_email_headers",
      "description": "Analyze email authentication headers (SPF, DKIM, DMARC, ARC) to assess email security and provide actionable recommendations.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "analyze_prose_json",
      "description": "Evaluate writing quality and provide structured JSON output rating novelty, clarity, and overall messaging effectiveness.",
      "tags": [
        "ANALYSIS",
        "WRITING",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "analyze_prose_pinker",
      "description": "Analyze writing style using Steven Pinker's principles from 'The Sense of Style' to improve clarity and effectiveness.",
      "tags": [
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "ask_uncle_duke",
      "description": "Provide expert software development guidance focusing on Java, Spring Framework, and frontend technologies with best practices.",
      "tags": [
        "DEVELOPMENT",
        "LEARNING"
      ]
    },
    {
      "patternName": "capture_thinkers_work",
      "description": "Extract and summarize key philosophical concepts, background, and impactful ideas from notable thinkers and their work.",
      "tags": [
        "EXTRACTION",
        "SUMMARIZATION",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "check_agreement",
      "description": "Review contracts and agreements to identify important stipulations, potential issues, and recommended changes for negotiation.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "clean_text",
      "description": "Format and clean text by fixing line breaks, capitalization, and punctuation while preserving original content and meaning.",
      "tags": [
        "WRITING",
        "CONVERSION"
      ]
    },
    {
      "patternName": "coding_master",
      "description": "Explain coding concepts and languages clearly for beginners using examples from reputable sources and proper syntax formatting.",
      "tags": [
        "DEVELOPMENT",
        "LEARNING"
      ]
    },
    {
      "patternName": "compare_and_contrast",
      "description": "Create structured comparisons of items in table format, highlighting key differences and similarities across relevant topics.",
      "tags": [
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "convert_to_markdown",
      "description": "Convert content to clean markdown format while preserving complete original content, formatting, and structure.",
      "tags": [
        "CONVERSION",
        "WRITING"
      ]
    },
    {
      "patternName": "create_5_sentence_summary",
      "description": "Generate increasingly concise summaries of content in five levels, from five words down to one word.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "create_ai_jobs_analysis",
      "description": "Analyze AI's impact on job categories, identifying automation risks and providing strategies for career resilience.",
      "tags": [
        "ANALYSIS",
        "AI",
        "BUSINESS"
      ]
    },
    {
      "patternName": "create_aphorisms",
      "description": "Compile relevant, attributed aphorisms from historical figures related to specific topics or themes.",
      "tags": [
        "EXTRACTION",
        "WRITING"
      ]
    },
    {
      "patternName": "create_better_frame",
      "description": "Develop positive mental frameworks for viewing challenging situations, emphasizing constructive perspectives and opportunities.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "SELF"
      ]
    },
    {
      "patternName": "create_coding_project",
      "description": "Design structured coding projects with clear architecture, implementation steps, and best practices using modern technologies.",
      "tags": [
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_command",
      "description": "Generate precise CLI commands for penetration testing tools based on documentation and specific requirements.",
      "tags": [
        "SECURITY",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_cyber_summary",
      "description": "Summarize cybersecurity incidents, vulnerabilities, and threats into concise, actionable intelligence briefings.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "create_diy",
      "description": "Create detailed, step-by-step DIY tutorials with clear instructions, required materials, and expected outcomes.",
      "tags": [
        "WRITING",
        "LEARNING",
        "SELF"
      ]
    },
    {
      "patternName": "create_formal_email",
      "description": "Compose professional email correspondence following business etiquette and maintaining appropriate tone and structure.",
      "tags": [
        "WRITING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "create_git_diff_commit",
      "description": "Generate clear git commit messages and commands that effectively communicate code changes and updates.",
      "tags": [
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_graph_from_input",
      "description": "Transform security program metrics into CSV data format for visualizing progress and improvements over time.",
      "tags": [
        "VISUALIZATION",
        "SECURITY",
        "CONVERSION"
      ]
    },
    {
      "patternName": "create_hormozi_offer",
      "description": "Create compelling business offers using Alex Hormozi's '$100M Offers' methodology and principles.",
      "tags": [
        "BUSINESS",
        "WRITING"
      ]
    },
    {
      "patternName": "create_idea_compass",
      "description": "Organize thoughts and concepts using a structured framework analyzing definitions, evidence, relationships, and implications.",
      "tags": [
        "ANALYSIS",
        "VISUALIZATION",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "create_investigation_visualization",
      "description": "Create detailed Graphviz visualizations of investigation data showing relationships, activities, and key findings.",
      "tags": [
        "VISUALIZATION",
        "SECURITY",
        "ANALYSIS"
      ]
    },
    {
      "patternName": "create_logo",
      "description": "Generate minimalist logo design prompts that capture brand essence through simple, elegant vector graphics.",
      "tags": [
        "VISUALIZATION",
        "BUSINESS"
      ]
    },
    {
      "patternName": "create_markmap_visualization",
      "description": "Transform complex ideas into hierarchical mind maps using Markmap syntax for visual concept representation.",
      "tags": [
        "VISUALIZATION",
        "CONVERSION",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "create_mermaid_visualization_for_github",
      "description": "Create GitHub-compatible Mermaid diagrams to visualize workflows, architectures, and processes in documentation.",
      "tags": [
        "VISUALIZATION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_newsletter_entry",
      "description": "Write concise, engaging newsletter content in Frontend Weekly style, focusing on key developments and insights.",
      "tags": [
        "WRITING",
        "SUMMARIZATION",
        "BUSINESS"
      ]
    },
    {
      "patternName": "create_npc",
      "description": "Generate detailed D&D 5E NPC characters with comprehensive backgrounds, personalities, and game statistics.",
      "tags": [
        "GAMING"
      ]
    },
    {
      "patternName": "create_pattern",
      "description": "Design structured patterns for AI prompts with clear identity, purpose, steps, and output instructions.",
      "tags": [
        "AI",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_prediction_block",
      "description": "Format and structure predictions from content for tracking and verification in markdown-based prediction logs.",
      "tags": [
        "AI",
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "create_recursive_outline",
      "description": "Break down complex tasks or ideas into hierarchical, actionable components through recursive decomposition.",
      "tags": [
        "ANALYSIS",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "create_report_finding",
      "description": "Document security assessment findings with clear descriptions, risks, recommendations, and supporting evidence.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "create_rpg_summary",
      "description": "Summarize RPG gaming sessions capturing key events, combat encounters, and narrative developments in structured format.",
      "tags": [
        "GAMING"
      ]
    },
    {
      "patternName": "create_show_intro",
      "description": "Craft compelling podcast or show introductions that effectively preview content and engage audience interest.",
      "tags": [
        "WRITING"
      ]
    },
    {
      "patternName": "create_story_explanation",
      "description": "Transform complex concepts into clear, engaging narratives that effectively communicate ideas and implications.",
      "tags": [
        "WRITING",
        "LEARNING"
      ]
    },
    {
      "patternName": "create_tags",
      "description": "Generate relevant, single-word tags for content categorization and mind mapping organization.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION",
        "WRITING"
      ]
    },
    {
      "patternName": "create_threat_scenarios",
      "description": "Develop realistic security threat scenarios based on risk analysis and attacker motivation assessment.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "create_ttrc_graph",
      "description": "Generate time-series data for visualizing critical vulnerability remediation metrics and progress.",
      "tags": [
        "SECURITY",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "create_ttrc_narrative",
      "description": "Create compelling narratives demonstrating security program improvements in vulnerability remediation efficiency.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "create_upgrade_pack",
      "description": "Extract world model updates and task algorithms from content to improve decision-making and processes.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "BUSINESS",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "create_video_chapters",
      "description": "Extract and organize video content into timestamped chapters highlighting key topics and moments.",
      "tags": [
        "EXTRACTION",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "create_visualization",
      "description": "Transform complex concepts into ASCII art visualizations with detailed explanations of represented relationships.",
      "tags": [
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "dialog_with_socrates",
      "description": "Engage in Socratic dialogue to explore ideas through questioning and critical examination of assumptions.",
      "tags": [
        "ANALYSIS",
        "LEARNING",
        "SELF",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "analyze_paper",
      "description": "Analyze a scientific paper to identify its primary findings and assess the quality and rigor of its conclusions.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "LEARNING"
      ]
    },
    {
      "patternName": "create_summary",
      "description": "Generate concise summaries of content by extracting key points, main ideas, and important takeaways into a structured format.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "extract_wisdom",
      "description": "Extract insightful ideas, practical habits, and meaningful recommendations from content, focusing on life wisdom and human flourishing.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "SUMMARIZATION",
        "WISDOM",
        "SELF"
      ]
    },
    {
      "patternName": "create_design_document",
      "description": "Create comprehensive software architecture documentation using the C4 model, including business context, security posture, and detailed system design.",
      "tags": [
        "DEVELOPMENT",
        "WRITING",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "create_stride_threat_model",
      "description": "Generate detailed threat models using STRIDE methodology to identify, analyze, and prioritize security threats for system components.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "extract_main_idea",
      "description": "Identify and distill the single most important or insightful idea from content, providing both the core concept and actionable recommendation.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION",
        "SUMMARIZATION"
      ]
    },
    {
      "patternName": "create_mermaid_visualization",
      "description": "Transform complex concepts and relationships into clear visual diagrams using Mermaid syntax, creating standalone visualizations that effectively convey ideas.",
      "tags": [
        "VISUALIZATION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "create_prd",
      "description": "Create precise and structured Product Requirements Documents (PRDs) from input requirements and specifications.",
      "tags": [
        "DEVELOPMENT",
        "WRITING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "explain_code",
      "description": "Analyze and explain code, security tool outputs, and configuration files, providing clear explanations of their functionality and implications.",
      "tags": [
        "DEVELOPMENT",
        "LEARNING"
      ]
    },
    {
      "patternName": "create_sigma_rules",
      "description": "Extract Tactics, Techniques, and Procedures from security publications and translate them into YAML-based Sigma detection rules.",
      "tags": [
        "SECURITY",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "extract_predictions",
      "description": "Identify and analyze predictions from content, extracting specific claims, timeframes, confidence levels, and verification criteria.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "create_user_story",
      "description": "Write clear, concise technical user stories with descriptions and acceptance criteria for software features and improvements.",
      "tags": [
        "DEVELOPMENT",
        "WRITING"
      ]
    },
    {
      "patternName": "analyze_threat_report",
      "description": "Extract and analyze key insights, trends, statistics, and recommendations from cybersecurity threat reports in a structured format.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "analyze_malware",
      "description": "Analyze malware behavior, extract indicators of compromise, identify MITRE ATT&CK techniques, and provide detection recommendations across multiple platforms.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "extract_book_recommendations",
      "description": "Extract and prioritize practical recommendations and actionable advice from books, presenting them in a clear, instructive format.",
      "tags": [
        "EXTRACTION",
        "SUMMARIZATION",
        "SELF"
      ]
    },
    {
      "patternName": "create_art_prompt",
      "description": "Transform concepts into detailed AI art prompts, incorporating style references and emotional elements to guide visual creation.",
      "tags": [
        "AI",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "create_network_threat_landscape",
      "description": "Analyze network ports and services to create comprehensive threat reports with risks, trends, and security recommendations.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "create_academic_paper",
      "description": "Transform content into high-quality academic papers using LaTeX formatting with professional layout and authoritative presentation.",
      "tags": [
        "WRITING",
        "RESEARCH",
        "LEARNING"
      ]
    },
    {
      "patternName": "create_keynote",
      "description": "Design TED-style presentations with narrative flow, concise slide content, speaker notes, and image descriptions for maximum impact.",
      "tags": [
        "WRITING",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "extract_core_message",
      "description": "Distill the fundamental message from presentations, essays, or bodies of work into a single, clear, impactful sentence.",
      "tags": [
        "ANALYSIS",
        "SUMMARIZATION"
      ]
    },
    {
      "patternName": "create_reading_plan",
      "description": "Design structured, three-phase reading plans with core, extended, and exploratory materials to build comprehensive knowledge of topics.",
      "tags": [
        "LEARNING",
        "SELF"
      ]
    },
    {
      "patternName": "extract_extraordinary_claims",
      "description": "Identify and extract claims that contradict scientific consensus, are difficult to verify, or conflict with expert understanding.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "create_quiz",
      "description": "Generate targeted review questions based on learning objectives, adapting difficulty to specified student levels and subject matter.",
      "tags": [
        "LEARNING"
      ]
    },
    {
      "patternName": "create_security_update",
      "description": "Compile concise security newsletters covering current threats, advisories, vulnerabilities, and critical cybersecurity developments with relevant links.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "extract_skills",
      "description": "Extract and classify hard and soft skills from job descriptions, organizing them into a structured skill inventory.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "create_micro_summary",
      "description": "Generate ultra-concise content summaries with one-sentence overview, key points, and essential takeaways in minimal words.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "extract_insights",
      "description": "Extract powerful insights about life, technology, and human flourishing from content, presenting them as concise, actionable bullet points.",
      "tags": [
        "EXTRACTION",
        "SELF"
      ]
    },
    {
      "patternName": "analyze_claims",
      "description": "Evaluate truth claims by analyzing supporting evidence, counter-arguments, and logical fallacies to provide balanced, objective assessments.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "analyze_debate",
      "description": "Analyze debate transcripts to identify key arguments, agreements, misunderstandings, and insights while measuring emotional intensity and participant interaction.",
      "tags": [
        "ANALYSIS",
        "SUMMARIZATION",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "analyze_incident",
      "description": "Extract and organize critical information from cybersecurity breach articles, including attack details, impact analysis, and actionable recommendations.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "analyze_interviewer_techniques",
      "description": "Study interviewer questions and methods to identify effective techniques, patterns, and strategies that lead to exceptional interviews.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_military_strategy",
      "description": "Examine historical battles by analyzing strategic decisions, tactical approaches, and pivotal moments to extract key military lessons.",
      "tags": [
        "ANALYSIS",
        "STRATEGY"
      ]
    },
    {
      "patternName": "analyze_logs",
      "description": "Examine server logs to identify patterns, anomalies, and potential issues, providing insights into system reliability and performance improvements.",
      "tags": [
        "DEVELOPMENT",
        "SECURITY"
      ]
    },
    {
      "patternName": "analyze_mistakes",
      "description": "Analyze past thinking errors and mistaken beliefs to identify patterns and prevent similar mistakes in current predictions and decisions.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "BUSINESS",
        "SELF",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "analyze_personality",
      "description": "Perform psychological analysis of individuals by examining their language, responses, and behaviors to reveal underlying personality traits and patterns.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "SELF"
      ]
    },
    {
      "patternName": "analyze_presentation",
      "description": "Evaluate presentations by scoring content novelty, speaker selflessness, and entertainment value to provide actionable feedback for improvement.",
      "tags": [
        "ANALYSIS",
        "REVIEW",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_product_feedback",
      "description": "Process and categorize user feedback to identify key themes, consolidate similar inputs, and prioritize actionable insights for product improvements.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_proposition",
      "description": "Examine ballot propositions to assess their purpose, potential impact, supporting arguments, and implications for stakeholders and regulations.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "analyze_prose",
      "description": "Evaluate writing quality by rating novelty of ideas, clarity of presentation, and prose style to provide targeted improvement recommendations.",
      "tags": [
        "ANALYSIS",
        "WRITING",
        "REVIEW"
      ]
    },
    {
      "patternName": "analyze_risk",
      "description": "Assess third-party vendor security compliance and privacy standards to determine risk levels and recommend appropriate security controls.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "analyze_sales_call",
      "description": "Evaluate sales call performance by analyzing pitch alignment, sales fundamentals, and customer interaction to provide actionable improvement recommendations.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_spiritual_text",
      "description": "Compare and contrast religious texts with the King James Bible, identifying unique claims, differences in tenets, and doctrinal variations.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "SELF"
      ]
    },
    {
      "patternName": "analyze_tech_impact",
      "description": "Evaluate technology projects' societal impact by analyzing outcomes, ethical considerations, and sustainability across environmental, economic, and social dimensions.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_threat_report_trends",
      "description": "Extract and analyze surprising, insightful, and significant trends from cybersecurity threat reports to identify emerging patterns and developments.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "answer_interview_question",
      "description": "Generate natural, experience-based responses to technical interview questions that demonstrate expertise while maintaining conversational tone and conciseness.",
      "tags": [
        "DEVELOPMENT",
        "LEARNING"
      ]
    },
    {
      "patternName": "ask_secure_by_design_questions",
      "description": "Generate comprehensive security-focused questions to guide secure system design and implementation across different architectural components.",
      "tags": [
        "SECURITY",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "analyze_patent",
      "description": "Analyze patent documents to evaluate novelty, inventive steps, and technical advantages while providing detailed explanations of problems solved and implementation approaches.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "analyze_threat_report_cmds",
      "description": "Extract and interpret cybersecurity commands from threat reports, providing detailed command-line arguments and implementation guidance from diverse expert perspectives.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "enrich_blog_post",
      "description": "Enhance markdown blog posts by improving structure, visuals, and formatting to optimize readability and engagement for static site generation.",
      "tags": [
        "WRITING",
        "VISUALIZATION"
      ]
    },
    {
      "patternName": "explain_docs",
      "description": "Transform technical documentation and instructions into clearer, more accessible explanations with improved structure and practical usage examples.",
      "tags": [
        "WRITING",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "explain_math",
      "description": "Explain mathematical concepts and equations clearly for students using step-by-step instructions, visual aids, and practical examples.",
      "tags": [
        "LEARNING"
      ]
    },
    {
      "patternName": "explain_project",
      "description": "Create comprehensive project overviews with installation instructions, usage examples, and practical applications while maintaining clear documentation structure.",
      "tags": [
        "DEVELOPMENT",
        "BUSINESS"
      ]
    },
    {
      "patternName": "explain_terms",
      "description": "Create comprehensive glossaries of advanced terms from content, providing clear definitions, explanations, and helpful analogies for better understanding.",
      "tags": [
        "WRITING",
        "LEARNING"
      ]
    },
    {
      "patternName": "export_data_as_csv",
      "description": "Extract structured data from content and convert it into properly formatted CSV files while preserving relationships and data integrity.",
      "tags": [
        "CONVERSION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "extract_algorithm_update_recommendations",
      "description": "Extract concise, practical recommendations for improving algorithms and processes from content, focusing on actionable implementation steps.",
      "tags": [
        "EXTRACTION",
        "DEVELOPMENT",
        "ANALYSIS",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_article_wisdom",
      "description": "Extract key insights, practical advice, and timeless wisdom from articles, organizing them into clear, actionable takeaways.",
      "tags": [
        "EXTRACTION",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_book_ideas",
      "description": "Identify and extract novel concepts, unique perspectives, and innovative ideas from books that could inspire new projects or creative works.",
      "tags": [
        "EXTRACTION",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_business_ideas",
      "description": "Identify potential business opportunities, market gaps, and entrepreneurial insights from content, presenting them as actionable venture concepts.",
      "tags": [
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_controversial_ideas",
      "description": "Identify and analyze contentious viewpoints, challenging assumptions, and debatable claims from content while maintaining objective analysis.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "extract_ctf_writeup",
      "description": "Extract key techniques, tools, and methodologies from CTF challenge writeups to create structured, educational security learning resources.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "extract_ideas",
      "description": "Extract and organize key concepts, innovative thoughts, and potential applications from content into structured, actionable idea collections.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "WISDOM",
        "SELF"
      ]
    },
    {
      "patternName": "extract_insights_dm",
      "description": "Extract and organize key insights from direct messages or conversations, focusing on valuable learnings and actionable takeaways.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "SUMMARIZATION",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_instructions",
      "description": "Extract and organize step-by-step procedures and guidelines from content into clear, sequential instructions for practical implementation.",
      "tags": [
        "EXTRACTION",
        "LEARNING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_jokes",
      "description": "Extract and categorize humorous content from text, organizing jokes, puns, and witty remarks while preserving their comedic timing and context.",
      "tags": [
        "OTHER"
      ]
    },
    {
      "patternName": "extract_latest_video",
      "description": "Extract and summarize key information from the most recent video in a channel or playlist, including title, timestamp, and main content points.",
      "tags": [
        "EXTRACTION",
        "SUMMARIZATION"
      ]
    },
    {
      "patternName": "extract_most_redeeming_thing",
      "description": "Identify and analyze the most positive or valuable aspect from content, even in challenging or critical contexts, to highlight constructive elements.",
      "tags": [
        "ANALYSIS",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_patterns",
      "description": "Identify and extract recurring patterns, themes, and methodologies from content to create reusable templates and systematic approaches.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_poc",
      "description": "Extract and document proof-of-concept demonstrations from technical content, including implementation steps, code samples, and validation methods.",
      "tags": [
        "DEVELOPMENT",
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_primary_problem",
      "description": "Identify and analyze the core problem or challenge from content, focusing on root causes and fundamental issues rather than symptoms.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "extract_primary_solution",
      "description": "Identify and analyze the main solution or approach proposed in content, focusing on key implementation steps and expected outcomes.",
      "tags": [
        "ANALYSIS",
        "EXTRACTION"
      ]
    },
    {
      "patternName": "extract_product_features",
      "description": "Extract and categorize key product features, capabilities, and specifications from content into a structured, comprehensive feature list.",
      "tags": [
        "EXTRACTION",
        "BUSINESS",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "extract_questions",
      "description": "Extract and categorize key questions, inquiries, and discussion points from content to create comprehensive Q&A resources.",
      "tags": [
        "EXTRACTION",
        "LEARNING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_recipe",
      "description": "Extract and format cooking recipes from content into structured instructions with ingredients, steps, and preparation details.",
      "tags": [
        "EXTRACTION",
        "WRITING",
        "CONVERSION",
        "SELF"
      ]
    },
    {
      "patternName": "extract_recommendations",
      "description": "Extract and prioritize suggested actions, advice, and recommendations from content, organizing them into clear, actionable guidance.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "SUMMARIZATION",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_references",
      "description": "Extract and format citations, sources, and bibliographic references from content into a structured, properly formatted reference list.",
      "tags": [
        "EXTRACTION",
        "RESEARCH",
        "WRITING",
        "LEARNING"
      ]
    },
    {
      "patternName": "extract_song_meaning",
      "description": "Analyze and interpret song lyrics to uncover deeper meanings, themes, metaphors, and cultural or historical references within musical compositions.",
      "tags": [
        "ANALYSIS",
        "SELF"
      ]
    },
    {
      "patternName": "extract_sponsors",
      "description": "Extract and organize sponsorship information from content, including sponsor names, promotional messages, and partnership details.",
      "tags": [
        "EXTRACTION",
        "BUSINESS"
      ]
    },
    {
      "patternName": "extract_videoid",
      "description": "Extract and parse video identifiers and URLs from content to create structured lists of video references and links.",
      "tags": [
        "EXTRACTION",
        "CONVERSION"
      ]
    },
    {
      "patternName": "extract_wisdom_agents",
      "description": "Extract and synthesize insights from AI agent interactions, focusing on emergent behaviors, learning patterns, and decision-making processes.",
      "tags": [
        "AI",
        "ANALYSIS",
        "EXTRACTION"
      ]
    },
    {
      "patternName": "extract_wisdom_dm",
      "description": "Extract and analyze key insights and learnings from direct message conversations, focusing on personal growth and practical wisdom.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "SUMMARIZATION",
        "SELF",
        "WISDOM"
      ]
    },
    {
      "patternName": "extract_wisdom_nometa",
      "description": "Extract pure insights and wisdom from content without metadata or contextual annotations, focusing on core principles and essential truths.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "CRITICAL THINKING",
        "WISDOM"
      ]
    },
    {
      "patternName": "find_hidden_message",
      "description": "Analyze content to uncover concealed meanings, subtle implications, and embedded messages that may not be immediately apparent.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "find_logical_fallacies",
      "description": "Identify and analyze logical errors, reasoning flaws, and argumentative fallacies in content to evaluate argument validity and soundness.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "get_wow_per_minute",
      "description": "Calculate and analyze the frequency of impressive or surprising moments in content to measure engagement and impact density.",
      "tags": [
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "get_youtube_rss",
      "description": "Generate and format RSS feed URLs for YouTube channels and playlists to enable automated content tracking and updates.",
      "tags": [
        "CONVERSION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "humanize",
      "description": "Transform technical or complex content into more approachable, relatable language while maintaining accuracy and key information.",
      "tags": [
        "WRITING",
        "CONVERSION"
      ]
    },
    {
      "patternName": "identify_dsrp_distinctions",
      "description": "Analyze content using DSRP framework to identify key distinctions, differences, and unique characteristics between concepts and ideas.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "identify_dsrp_perspectives",
      "description": "Analyze content using DSRP framework to identify different viewpoints, stakeholder perspectives, and alternative ways of understanding concepts.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "identify_dsrp_relationships",
      "description": "Analyze content using DSRP framework to identify connections, correlations, and causal relationships between different concepts and elements.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "identify_dsrp_systems",
      "description": "Analyze content using DSRP framework to identify systems, hierarchies, and organizational structures that connect different components and ideas.",
      "tags": [
        "ANALYSIS",
        "RESEARCH"
      ]
    },
    {
      "patternName": "identify_job_stories",
      "description": "Extract and analyze user job stories from content to understand core motivations, situational contexts, and desired outcomes in product usage.",
      "tags": [
        "ANALYSIS",
        "BUSINESS",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "improve_academic_writing",
      "description": "Enhance academic writing by improving clarity, structure, argumentation, and scholarly tone while maintaining rigorous academic standards.",
      "tags": [
        "WRITING",
        "RESEARCH"
      ]
    },
    {
      "patternName": "improve_prompt",
      "description": "Enhance AI prompts by refining clarity, specificity, and structure to generate more accurate, relevant, and useful responses.",
      "tags": [
        "AI",
        "WRITING",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "improve_report_finding",
      "description": "Enhance security report findings by improving clarity, technical accuracy, risk assessment, and remediation recommendations.",
      "tags": [
        "SECURITY"
      ]
    },
    {
      "patternName": "improve_writing",
      "description": "Enhance written content by improving clarity, flow, structure, and style while maintaining the original message and intent.",
      "tags": [
        "WRITING"
      ]
    },
    {
      "patternName": "judge_output",
      "description": "Evaluate AI-generated outputs for quality, accuracy, relevance, and adherence to specified requirements and standards.",
      "tags": [
        "AI",
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "label_and_rate",
      "description": "Categorize and evaluate content by assigning descriptive labels and numerical ratings based on defined criteria and quality metrics.",
      "tags": [
        "ANALYSIS",
        "REVIEW",
        "WRITING"
      ]
    },
    {
      "patternName": "md_callout",
      "description": "Generate markdown callout blocks to highlight important information, warnings, notes, and tips with appropriate styling and formatting.",
      "tags": [
        "WRITING",
        "CONVERSION"
      ]
    },
    {
      "patternName": "official_pattern_template",
      "description": "Define standardized pattern templates with structured sections for identity, purpose, steps, and output specifications to ensure consistent pattern creation.",
      "tags": [
        "DEVELOPMENT",
        "WRITING"
      ]
    },
    {
      "patternName": "prepare_7s_strategy",
      "description": "Apply McKinsey's 7S framework to analyze organizational alignment across strategy, structure, systems, shared values, style, staff, and skills.",
      "tags": [
        "ANALYSIS",
        "BUSINESS",
        "STRATEGY"
      ]
    },
    {
      "patternName": "provide_guidance",
      "description": "Offer expert advice and recommendations tailored to specific situations, providing clear, actionable steps and best practices for implementation.",
      "tags": [
        "ANALYSIS",
        "LEARNING",
        "SELF"
      ]
    },
    {
      "patternName": "rate_ai_response",
      "description": "Evaluate AI responses for quality, coherence, relevance, and effectiveness, providing detailed scoring and improvement suggestions.",
      "tags": [
        "AI",
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "rate_ai_result",
      "description": "Assess AI-generated outputs against predefined success criteria, providing quantitative scores and qualitative feedback for improvement.",
      "tags": [
        "AI",
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "rate_content",
      "description": "Evaluate content quality across multiple dimensions including accuracy, clarity, engagement, and value, providing comprehensive scoring with detailed justification.",
      "tags": [
        "ANALYSIS",
        "REVIEW",
        "WRITING"
      ]
    },
    {
      "patternName": "rate_value",
      "description": "Assess the practical value and impact potential of content by evaluating its utility, applicability, and potential return on investment.",
      "tags": [
        "ANALYSIS",
        "BUSINESS",
        "REVIEW"
      ]
    },
    {
      "patternName": "raw_query",
      "description": "Process direct, unstructured queries by interpreting intent and providing focused, relevant responses without additional formatting or templates.",
      "tags": [
        "AI",
        "ANALYSIS"
      ]
    },
    {
      "patternName": "recommend_artists",
      "description": "Suggest relevant artists and creators based on user preferences, style similarities, and thematic connections across various artistic mediums.",
      "tags": [
        "ANALYSIS",
        "RESEARCH",
        "SELF"
      ]
    },
    {
      "patternName": "recommend_pipeline_upgrades",
      "description": "Analyze CI/CD pipelines and suggest improvements for efficiency, reliability, and security based on industry best practices and modern tooling.",
      "tags": [
        "DEVELOPMENT",
        "SECURITY"
      ]
    },
    {
      "patternName": "recommend_talkpanel_topics",
      "description": "Generate engaging discussion topics and questions for panel talks based on audience interests, current trends, and speaker expertise.",
      "tags": [
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "refine_design_document",
      "description": "Enhance software design documentation by improving clarity, completeness, technical accuracy, and alignment with architectural best practices.",
      "tags": [
        "DEVELOPMENT",
        "WRITING"
      ]
    },
    {
      "patternName": "review_design",
      "description": "Evaluate software design proposals and architectures for scalability, maintainability, security, and adherence to design principles and patterns.",
      "tags": [
        "DEVELOPMENT",
        "ANALYSIS",
        "REVIEW"
      ]
    },
    {
      "patternName": "sanitize_broken_html_to_markdown",
      "description": "Clean and convert malformed HTML content into well-structured markdown format while preserving content hierarchy and semantic meaning.",
      "tags": [
        "CONVERSION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "show_fabric_options_markmap",
      "description": "Generate hierarchical mind maps visualizing Fabric framework capabilities, patterns, and configuration options using Markmap syntax.",
      "tags": [
        "VISUALIZATION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "solve_with_cot",
      "description": "Solve complex problems using chain-of-thought reasoning, breaking down solutions into clear, logical steps with explicit intermediate reasoning.",
      "tags": [
        "AI",
        "ANALYSIS",
        "LEARNING"
      ]
    },
    {
      "patternName": "suggest_pattern",
      "description": "Recommend appropriate Fabric patterns based on user requirements, task characteristics, and desired outcomes to optimize pattern selection.",
      "tags": [
        "AI",
        "ANALYSIS",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "summarize",
      "description": "Generate comprehensive content summaries that capture key points, main arguments, and essential details while maintaining context and clarity.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "summarize_debate",
      "description": "Create structured summaries of debates highlighting key arguments, points of agreement, areas of contention, and notable exchanges between participants.",
      "tags": [
        "SUMMARIZATION",
        "ANALYSIS",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "summarize_git_changes",
      "description": "Generate clear, concise summaries of git repository changes, highlighting key modifications, additions, and deletions across commits.",
      "tags": [
        "DEVELOPMENT",
        "SUMMARIZATION"
      ]
    },
    {
      "patternName": "summarize_git_diff",
      "description": "Analyze git diff output to provide clear, structured summaries of code changes, highlighting functional modifications and their potential impact.",
      "tags": [
        "DEVELOPMENT",
        "ANALYSIS"
      ]
    },
    {
      "patternName": "summarize_lecture",
      "description": "Create structured summaries of academic lectures capturing key concepts, examples, methodologies, and important takeaways in an organized format.",
      "tags": [
        "SUMMARIZATION",
        "LEARNING",
        "WRITING"
      ]
    },
    {
      "patternName": "summarize_legislation",
      "description": "Create comprehensive summaries of legislative documents highlighting key provisions, amendments, implications, and affected stakeholders.",
      "tags": [
        "SUMMARIZATION",
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "summarize_meeting",
      "description": "Create structured meeting summaries capturing key discussions, decisions, action items, and assigned responsibilities in a clear, organized format.",
      "tags": [
        "SUMMARIZATION",
        "WRITING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "summarize_micro",
      "description": "Generate extremely concise summaries of content by distilling complex information into essential points using minimal words while preserving key meaning.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "summarize_newsletter",
      "description": "Create concise summaries of newsletter content highlighting key updates, announcements, trends, and notable developments in a structured format.",
      "tags": [
        "SUMMARIZATION",
        "WRITING"
      ]
    },
    {
      "patternName": "summarize_paper",
      "description": "Create structured summaries of academic papers highlighting research objectives, methodology, key findings, and significant conclusions in a clear format.",
      "tags": [
        "SUMMARIZATION",
        "RESEARCH",
        "WRITING",
        "LEARNING"
      ]
    },
    {
      "patternName": "summarize_prompt",
      "description": "Analyze and summarize AI prompts to identify key instructions, requirements, constraints, and expected outputs in a clear, structured format.",
      "tags": [
        "ANALYSIS",
        "AI"
      ]
    },
    {
      "patternName": "summarize_pull-requests",
      "description": "Create concise summaries of pull requests highlighting key code changes, implementation details, and potential impacts in a clear, developer-friendly format.",
      "tags": [
        "SUMMARIZATION",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "summarize_rpg_session",
      "description": "Create detailed summaries of roleplaying game sessions capturing key story events, character developments, combat encounters, and important decisions in a narrative format.",
      "tags": [
        "SUMMARIZATION",
        "GAMING",
        "WRITING"
      ]
    },
    {
      "patternName": "t_analyze_challenge_handling",
      "description": "Evaluate approaches to handling challenges by analyzing response strategies, coping mechanisms, and problem-solving methods to identify effective patterns.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "t_check_metrics",
      "description": "Analyze and evaluate performance metrics, tracking progress against goals while identifying trends, patterns, and areas for improvement.",
      "tags": [
        "ANALYSIS",
        "BUSINESS"
      ]
    },
    {
      "patternName": "t_create_h3_career",
      "description": "Generate structured career development plans using the Head, Heart, Hands (H3) framework to align skills, passions, and practical actions.",
      "tags": [
        "STRATEGY",
        "BUSINESS",
        "WRITING",
        "SELF"
      ]
    },
    {
      "patternName": "t_create_opening_sentences",
      "description": "Generate compelling opening sentences for content that capture attention, establish context, and effectively introduce key themes or concepts.",
      "tags": [
        "WRITING"
      ]
    },
    {
      "patternName": "t_describe_life_outlook",
      "description": "Analyze and articulate personal life philosophies, values, and worldviews to understand core beliefs and their influence on decision-making and behavior.",
      "tags": [
        "ANALYSIS",
        "WRITING",
        "SELF"
      ]
    },
    {
      "patternName": "t_extract_intro_sentences",
      "description": "Extract and analyze introductory sentences from content to identify effective hooks, context-setting techniques, and engagement strategies.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "t_extract_panel_topics",
      "description": "Extract and organize potential discussion topics from content to create engaging panel discussions, identifying key themes, controversies, and audience-relevant points.",
      "tags": [
        "EXTRACTION",
        "ANALYSIS",
        "WRITING"
      ]
    },
    {
      "patternName": "t_find_blindspots",
      "description": "Identify and analyze potential blind spots in thinking, planning, or decision-making processes to uncover overlooked factors and improve strategic awareness.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "t_find_negative_thinking",
      "description": "Identify and analyze patterns of negative thinking in content to recognize cognitive distortions, self-limiting beliefs, and opportunities for reframing.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "t_find_neglected_goals",
      "description": "Identify and analyze goals, aspirations, or objectives that have been overlooked or deprioritized to surface opportunities for renewed focus and action.",
      "tags": [
        "ANALYSIS",
        "STRATEGY",
        "CRITICAL THINKING",
        "SELF"
      ]
    },
    {
      "patternName": "t_give_encouragement",
      "description": "Generate personalized, context-aware messages of encouragement that acknowledge challenges while reinforcing strengths and promoting resilience.",
      "tags": [
        "WRITING",
        "SELF"
      ]
    },
    {
      "patternName": "t_red_team_thinking",
      "description": "Apply adversarial thinking to analyze plans, systems, or ideas by identifying potential weaknesses, attack vectors, and failure modes to improve resilience.",
      "tags": [
        "ANALYSIS",
        "SECURITY",
        "STRATEGY",
        "CRITICAL THINKING"
      ]
    },
    {
      "patternName": "t_threat_model_plans",
      "description": "Analyze plans and strategies through a security lens to identify potential threats, vulnerabilities, and risks while providing mitigation recommendations.",
      "tags": [
        "SECURITY",
        "ANALYSIS",
        "STRATEGY"
      ]
    },
    {
      "patternName": "t_visualize_mission_goals_projects",
      "description": "Create visual representations of organizational missions, strategic goals, and project hierarchies to clarify relationships and track progress toward objectives.",
      "tags": [
        "VISUALIZATION",
        "BUSINESS",
        "STRATEGY"
      ]
    },
    {
      "patternName": "t_year_in_review",
      "description": "Generate comprehensive annual reviews by analyzing achievements, challenges, learnings, and growth opportunities while identifying patterns and setting future directions.",
      "tags": [
        "ANALYSIS",
        "WRITING",
        "BUSINESS"
      ]
    },
    {
      "patternName": "to_flashcards",
      "description": "Convert educational content into structured flashcard format with clear questions and answers, optimized for spaced repetition learning.",
      "tags": [
        "LEARNING",
        "CONVERSION"
      ]
    },
    {
      "patternName": "transcribe_minutes",
      "description": "Convert meeting recordings or notes into structured, well-organized minutes capturing key discussions, decisions, action items, and attendee contributions.",
      "tags": [
        "WRITING",
        "BUSINESS",
        "CONVERSION"
      ]
    },
    {
      "patternName": "translate",
      "description": "Convert content between languages while preserving meaning, context, and cultural nuances, ensuring accurate and natural-sounding translations.",
      "tags": [
        "CONVERSION"
      ]
    },
    {
      "patternName": "tweet",
      "description": "Transform content into concise, engaging tweets that capture key messages while adhering to platform constraints and social media best practices.",
      "tags": [
        "WRITING",
        "CONVERSION"
      ]
    },
    {
      "patternName": "write_essay",
      "description": "Create well-structured essays with clear thesis statements, supporting arguments, evidence, and conclusions while maintaining academic writing standards.",
      "tags": [
        "WRITING",
        "RESEARCH",
        "LEARNING"
      ]
    },
    {
      "patternName": "write_hackerone_report",
      "description": "Create detailed vulnerability reports following HackerOne's format, including clear reproduction steps, impact analysis, and remediation recommendations.",
      "tags": [
        "SECURITY",
        "WRITING",
        "ANALYSIS"
      ]
    },
    {
      "patternName": "write_latex",
      "description": "Generate professional LaTeX documents with proper formatting, mathematical notation, citations, and cross-references following academic publishing standards.",
      "tags": [
        "WRITING",
        "RESEARCH",
        "CONVERSION"
      ]
    },
    {
      "patternName": "write_micro_essay",
      "description": "Create concise, focused essays that present a single key idea with supporting evidence and analysis in a highly condensed format.",
      "tags": [
        "WRITING",
        "RESEARCH"
      ]
    },
    {
      "patternName": "write_nuclei_template_rule",
      "description": "Generate Nuclei vulnerability scanning templates with detection logic, payload patterns, and validation rules following the template syntax specification.",
      "tags": [
        "SECURITY",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "write_pull-request",
      "description": "Create comprehensive pull request descriptions with clear summaries of changes, implementation details, testing procedures, and related issue references.",
      "tags": [
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "write_semgrep_rule",
      "description": "Create Semgrep pattern matching rules for static code analysis, including detection patterns, metadata, and fix suggestions following the rule syntax specification.",
      "tags": [
        "SECURITY",
        "DEVELOPMENT"
      ]
    },
    {
      "patternName": "extract_wisdom_short",
      "description": "[Description pending]",
      "tags": []
    }
  ]
}